Былков_ДА_70180166/src/Documents/НаправлениеНаПересдачу/НаправлениеНаПересдачу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаправлениеНаПересдачу</name>
  <basedOn>Document.ИдентификацияАкадемическихЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ДатыПересдач</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>EnumRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>EnumRef.Время</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ИдентификацияАкадемическихЗадолженностей</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/Documents/ИндивидуальныйПланЛиквидацииЗадолженностей/ИндивидуальныйПланЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИндивидуальныйПланЛиквидацииЗадолженностей</name>
  <basedOn>Document.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</basedOn>
  <registerRecords>InformationRegister.ДатыПересдач</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>EnumRef.Время</types>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>DocumentRef.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/CommonModules/ОбщиеПроцедурыСистемы/Module.bsl
// Проверяет уникальность даты и времени в документах НаправлениеНаПересдачу и ИндивидуальныйПланЛиквидацииЗадолженностей
&НаСервере
Процедура ПроверитьУникальностьДатыИВремени(ТипДокумента, Дата, Время, Аудитория, Ссылка, Отказ) Экспорт
    
    Отказ = Ложь;
    
    // Проверяем оба типа документов
    ТипыДляПроверки = Новый Массив;
    ТипыДляПроверки.Добавить("НаправлениеНаПересдачу");
    ТипыДляПроверки.Добавить("ИндивидуальныйПланЛиквидацииЗадолженностей");
    
    Для Каждого ТекущийТип Из ТипыДляПроверки Цикл
        Запрос = Новый Запрос;
        
        Если ТекущийТип = "НаправлениеНаПересдачу" Тогда
            Запрос.Текст =
            "ВЫБРАТЬ
            |   НаправлениеНаПересдачу.Ссылка КАК Ссылка
            |ИЗ
            |   Документ.НаправлениеНаПересдачу КАК НаправлениеНаПересдачу
            |ГДЕ
            |   НаправлениеНаПересдачу.ДатаПроведения = &Дата
            |   И НаправлениеНаПересдачу.Время = &Время
            |   И НаправлениеНаПересдачу.Аудитория = &Аудитория
            |   И НЕ НаправлениеНаПересдачу.ПометкаУдаления
            |   И НаправлениеНаПересдачу.Проведен = ИСТИНА";
            
            // Для документов того же типа исключаем текущий документ из проверки
            Если ТипДокумента = "НаправлениеНаПересдачу" Тогда
                Запрос.Текст = Запрос.Текст + "
                |   И НаправлениеНаПересдачу.Ссылка <> &Ссылка";
            КонецЕсли;
            
        ИначеЕсли ТекущийТип = "ИндивидуальныйПланЛиквидацииЗадолженностей" Тогда
            Запрос.Текст =
            "ВЫБРАТЬ
            |   ИндивидуальныйПланЛиквидацииЗадолженностей.Ссылка КАК Ссылка
            |ИЗ
            |   Документ.ИндивидуальныйПланЛиквидацииЗадолженностей КАК ИндивидуальныйПланЛиквидацииЗадолженностей
            |ГДЕ
            |   ИндивидуальныйПланЛиквидацииЗадолженностей.ДатаПересдачи = &Дата
            |   И ИндивидуальныйПланЛиквидацииЗадолженностей.Время = &Время
            |   И ИндивидуальныйПланЛиквидацииЗадолженностей.Аудитория = &Аудитория
            |   И НЕ ИндивидуальныйПланЛиквидацииЗадолженностей.ПометкаУдаления
            |   И ИндивидуальныйПланЛиквидацииЗадолженностей.Проведен = ИСТИНА";
            
            // Для документов того же типа исключаем текущий документ из проверки
            Если ТипДокумента = "ИндивидуальныйПланЛиквидацииЗадолженностей" Тогда
                Запрос.Текст = Запрос.Текст + "
                |   И ИндивидуальныйПланЛиквидацииЗадолженностей.Ссылка <> &Ссылка";
            КонецЕсли;
        КонецЕсли;
        
        Запрос.УстановитьПараметр("Дата", Дата);
        Запрос.УстановитьПараметр("Время", Время);
        Запрос.УстановитьПараметр("Аудитория", Аудитория);
        Запрос.УстановитьПараметр("Ссылка", Ссылка);
        
        Результат = Запрос.Выполнить();
        
        Если Не Результат.Пустой() Тогда
            Отказ = Истина;
            Возврат;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры
